#include <stdio.h>

int main() {
    // นิพจน์ A: ใช้ตัวดำเนินการ + และ * ซึ่ง * มีลำดับความสำคัญสูงกว่า
    // ดังนั้นคำนวณ 5*2+-2
    int A = -2 + 5 * 2; // A = -2 + 10 → A = 8
    printf("A = %d\n", A);  // แสดงผลลัพธ์ของ A

    // นิพจน์ B: ตัวดำเนินการ / และ * มีลำดับความสำคัญเท่ากันจึงคำนวณจากซ้ายไปขวา
    // 10 / 2 = 5, จากนั้น 5 * 3 = 15
    int B = 10 / 2 * 3; // B = 5 * 3 → B = 15
    printf("B = %d\n", B);  // แสดงผลลัพธ์ของ B

    // นิพจน์ C:คำนวณในวงเล็บก่อนจากนั้นก็คำนวณ / และ * แล้วค่อย +
    // 4 % 2 = 0 → 3 * 0 = 0 → 6 / 2 = 3 → 3 + 0 = 3
    int C = 6 / 2 + 3 * (4 % 2); // C = 3 + 0 → C = 3
    printf("C = %d\n", C);  // แสดงผลลัพธ์ของ C

    // นิพจน์ D:คำนวณในวงเล็บก่อนจากนั้นก็คำนวณค่าจากซ้ายไปขวา
    // 5 + 2 = 7 → 7 * 15 = 105 → 105 % 4 = 1
    int D = (5 + 2) * 15 % 4; // D = 105 % 4 → D = 1
    printf("D = %d\n", D);  // แสดงผลลัพธ์ของ D

    // นิพจน์ E:คำนวน * และ / ก่อนจากนั้นค่อยคำนวณ + - ตามลำดับ
    // 2 * 2 = 4 → 6 / 2 = 3 → 6 + 4 - 3 = 7
    int E = 6 + 2 * 2 - 6 / 2; // E = 6 + 4 - 3 → E = 7
    printf("E = %d\n", E);  // แสดงผลลัพธ์ของ E

    // นิพจน์ F:คำนวณในวงเล็บก่อน จากนั้นก็คำนวณ * / และ + - ตามลำดับ
    // 3 * 2 = 6, 8 / 4 = 2, 6 % 5 = 1
    // ดังนั้น 5 + 6 - 2 + 1 = 10
    int F = 5 + 3 * 2 - 8 / 4 + (6 % 5); // F = 5 + 6 - 2 + 1 → F = 10
    printf("F = %d\n", F);  // แสดงผลลัพธ์ของ F

    // นิพจน์ G:คำนวณในวงเล็บก่อน จากนั้นก็คำนวณ * / และ + - ตามลำดับ
    // 4 + 3 = 7 → 7 * 2 = 14 → 2 + 3 = 5 → 10 / 5 = 2 → 14 - 2 = 12
    int G = (4 + 3) * 2 - 10 / (2 + 3); // G = 14 - 2 → G = 12
    printf("G = %d\n", G);  // แสดงผลลัพธ์ของ G

    return 0;   //คืนค่า 0; เสร็จสิ้นกระบวนการ
}