#include <stdio.h>

int main() {
    int x = 12, y = 7, z = 12;

    printf("1. x > y = %d\n", x > y);                                           // 12 > 7 เป็นจริง(1)
    printf("2. x < z = %d\n", x < z);                                           // 12 < 12 เท็จ(0)
    printf("3. x == z = %d\n", x == z);                                         // 12 == 12 เป็นจริง(1)
    printf("4. x != y = %d\n", x != y);                                         // 12 != 7 เป็นจริง(1)
    printf("5. (2*5 >= y) || (5 != (5/3)) = %d\n", (2*5 >= y) || (5 != (5/3))); // 10 >= 7 || 5 != 1 เป็นจริง(1)
    printf("6. !(x < y) = %d\n", !(x < y));                                     // !(12 < 7) เป็นจริง(1)
    printf("7. ((x + y) > (z * 2)) = %d\n", ((x + y) > (z * 2)));                       // 19 > 24 เท็จ(0)
    printf("8. (x %% 2 == 0) && (y %% 2 == 1) = %d\n", (x % 2 == 0) && (y % 2 == 1));   //เป็นจริง(1)
    printf("9. (x > y) && (z < y) = %d\n", (x > y) && (z < y));                         // 1 && 0 เท็จ(0)

    return 0;           //คืนค่า 0; เสร็จสิ้นกระบวนการ
}