#include <stdio.h>

int main() {
    int a = 5, b = 17;
    float c = 8.5, d = 4.0;
    printf("a = %d, b = %d, c = %.1f, d = %.1f\n", a, b, c, d);     //1.แสดงค่าที่กำหนดไว้ใน int และ float
    printf("d + a = %.1f\n", d + a);                                //2.ผลการคำนวณของ d + a
    printf("a - b = %d\n", a - b);                                  //3.ผลการคำนวณของ a - b
    printf("c * d = %.2f\n", c * d);                                //4.ผลการคำนวณของ c * d
    printf("a * c = %.2f\n", a * c);                                //5.ผลการคำนวณของ a * c
    printf("c / d = %.2f\n", c / d);                                //6.ผลการคำนวณของ c / d
    printf("b / c = %.2f\n", b / c);                                //7.ผลการคำนวณของ b / c
    printf("a %% b = %d\n", a % b);                                 //8.ผลการคำนวณของ a % b (ใช้ได้ เพราะเป็น int)
    printf("(int)c %% a = %d\n", ((int)c) % a);                     //9.ผลการคำนวณของ c % a → โดยต้องแปลง c เป็น int ก่อน
    printf("(int)c %% (int)d = %d\n", ((int)c) % ((int)d));         //10.ผลการคำนวณของ c % d → โดยต้องแปลงทั้ง c และ d เป็น int ก่อน

    return 0;                       //คืนค่า 0; เสร็จสิ้นกระบวนการ
}

                                    //1.แสดงค่า(a = 5, b = 17, c = 8.5, d = 4.0);
                                    //2.คำนวณค่าและแสดงผล(4.0 + 5 = 9.0(ตอบในรูปทศนิยม 1 ตำแหน่ง));  
                                    //3.คำนวณค่าและแสดงผล(5 - 17 = -12); 
                                    //4.คำนวณค่าและแสดงผล(8.5 * 4.0 = 34.00(ตอบในรูปทศนิยม 2 ตำแหน่ง));
                                    //5.คำนวณค่าและแสดงผล("5 * 8.5 = 42.50 (ตอบในรูปทศนิยม 2 ตำแหน่ง));  
                                    //6.คำนวณค่าและแสดงผล(8.5 / 4.0 = 2.12(ตอบในรูปทศนิยม 2 ตำแหน่ง));  
                                    //7.คำนวณค่าและแสดงผล(17 / 8.5 = 2.00(ตอบในรูปทศนิยม 2 ตำแหน่ง));
                                    //8.คำนวณค่าและแสดงผล(5 % 17 = 5);
                                    //9.คำนวณค่าและแสดงผล(8 % 5 = 3);
                                    //10.คำนวณค่าและแสดงผล(8 % 4 = 0);